using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
 * 클래스 기반의 객체 지향 언어는 클래스라는 기능을 사용해서 우리가 원하는 새로운 자료형을 정의합니다.
 * 클래스에는 속성을 나타내는 변수 외에도 행위를 나타내는 메서드를 넣을 수 있습니다. 
 * Car     car1    =   new         Car();                -> 인스턴스 생성
 * 클래스  인스턴스     new키워드   생성자 
 * 클래스는 사용자 정의 자료형입니다. 그리고 이러한 자료형을 벼눗로 선언한 것을 인스턴스 또는 객체라고 부릅니다.
 * 그리고 클래스 이름과 같은 메서드(클래스 이름 뒤에 괄호가 붙은 것)를 메서드라고 부릅니다.
 * 
 * 
 * 
 * Random random = new Random();
 * random.Next(20, 50) : 20과 50사이의 임의의 정수를 생성
 * 
 * 인스턴스(의) 멤버 : 인스턴스(random)뒤에 점을 찍고 사용하는 멤버(Next)
 * 인스턴스 변수 : 해당멤버가 변수인 것
 * 인스턴스 메서드 : 해당멤버가 메서드인 것
 * 인스턴스 속성 : 해당멤버가 속성인 것
 * 
 * 제네릭 : C#에서 클래스를 선언할 때 어떤 자료형인지를 알려주기 위해 사용하는 것
 * List<int> list = new List<int>();   
 * 
 * 참조 추가 방법 : ctrl + . 
 * 
 * Math클래스는 인스턴스를 만들지 않고 사용한다.
 * Console.WriteLine(Math.Abs(-52));
 * 클래스 변수, 클래스 메서드 : 인스턴스 없이 클래스 이름을 바로 사용하여 변수와 메서드를 만들어 사용하는 것
 * 
 * 클래스(의) 멤버 : 클래스 뒤에 점을 찍고 사용하는 멤버           '의'가 생략되어있다고 생각하면 이해하기 편할 듯
 * 클래스 변수, 클래스 메서드, 클래스 속성
 * 
 * 
 * 클래스 기반의 개겣 지향 프로그래밍 언어의 네가지 특징 : 추상화, 캡슐화, 상속, 다형성
 * 
 * 리스트의 요소 제거에 사용하는 메서드 : Remove(객체를 지정하여 특정요소를 제거), RemoveAt(인덱스를 지정하여 특정 위치에 있는 요소를 제거)
 * 리스트의 요소를 제거할 때에는 반드시 역for반복문을 사용해야한다.
 * 
 * 
 */



namespace book.C샵_개념
{
    internal class ch05
    {
        
    }
}
