using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;



/*
 * 프로그래밍 언어라는 것은 여기서 식별자(글자) 뒤에 괄호가 있으면 메서드(함수)가 호출하는 행위라는 규칙만 지정합니다.
 * 라이브러리  : 쉽게 사용할 수 있도록 미리 만들어준 코드, 소프트웨어를 만들 때 사용하는 클래스 또는 서브루틴의 집합, 사용자 코드에서 호출되는 것
 * 프레임워크 : 제어 역전이 있는 대규모의 라이브러리, 프로그램의 초기화부터 종료까지의 흐름을 직접 관리한다
 * 라이브러는 개발자가 사용해줘야하며 프로그램 스스로는 아무것도 하지 못한다. 
 * 하지만 프레임워크는 오히려 개발자가 제어하던 코드를 프레임워크가 제어한다. 이를 제어 역전이라고 한다.
 * 인텔리센스 : 자동완성기능
 * 표현식 : 값을 만들어내는 간단한 코드
 * 문장 : 프로그래밍에서 실행할 수 있는 최소의 코드, ;으로 끝남
 * 클래스, 속성, 메서드, 네임스페이스의 이름은 항상 대문자로 시작
 * 지역변수와 전역변수의 이름은 소문자로 시작
 * 키워드 : 특별한 의미가 부여된 단어들, 정해져있음
 * 식별자 : 이름을 붙일 때에 사용하는 단어로서 변수, 메서드 등으로 사용된다
 * 메서드 : 식별자 뒤에 괄호가 있는 식별자 / 그 외의 것은 변수
 * 매개변수 : 메서드의 괄호 안에 넣는 것
 * 여러단어로 이루어진 식별자는 각 단어의 첫글자를 대문자로 한다.
 * 변수 : 값을 저장할 때 사용하는 식별자
 * 변수를 선언한다 : 변수를 만드는 것
 * 변수에 값을 할당한다 : 변수에 값을 넣는 것
 * var키워드 : 변수의 자료형(정수형, 실수형, 논리형, 문자열 등)을 자동으로 지정한다, 그 후 바뀌지 않는다, 메서드 내부에 선언할 때(지역변수로 선언할 때)만 적용 가능
 * 지역변수 : 메서드 내부에 선언되어 있는 변수
 * 강제 자료형 변환 : 강제로 자료형을 변환하는 것, int intNumber = (int)longNumber
 * 다른 자료형을 숫자로 변환 : ex) int.Parse("52")
 * 다른 자료형을 문자열로 변환 : ex) (10).ToString()
 * 소수점 제거 : 52.5631ToString("0.0") 소수점 아래 첫번째까지 나옴
 * 다른 자료형을 bool로 변환 : ex) bool.Parse("True")
 * 
 * 
 */


namespace book.C샵_개념
{
    internal class ch01_개념
    {
    }
}
